In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv('real-estate-prices.csv', header=None, names = ['Size', 'Price'])

In [3]:
df[(df['Size'] > 1000) & (df['Size'] < 2000)].head()

   Size   Price
1  1600  329900
3  1416  232000
5  1985  299900
6  1534  314900
7  1427  198999

In [4]:
df['PricePerSquareFoot'] = df['Price'] / df['Size']

In [5]:
df.head()

   Size   Price  PricePerSquareFoot
0  2104  399900          190.066540
1  1600  329900          206.187500
2  2400  369000          153.750000
3  1416  232000          163.841808
4  3000  539900          179.966667

In [6]:
type((df['Size'] > 1000) & (df['Size'] < 2000))

pandas.core.series.Series

### Example of SQL-like Functions

In [7]:
df = pd.read_csv('real-estate-prices.csv', header=None, names = ['Size', 'Price'])

In [8]:
top5 = df[['Size', 'Price']] \
    [df['Size'] > 3000] \
    .sort_values(by='Price', ascending=[False]) \
    .head(5)

In [9]:
top5

    Size   Price
13  4478  699900
19  3031  599000
33  3137  579900
24  3890  573900
38  4215  549000

In [10]:
top5['Score'] = 100

In [11]:
df.iloc[13]

Size       4478
Price    699900
Name: 13, dtype: int64

In [12]:
top5 = (df.loc[df['Size'] > 1000, ["Size", "Price"]]
    .sort_values(by='Price', ascending=[False])
    .head(5))
df.loc[top5.index, 'Score'] = 100

In [13]:
df.loc[13]

Size       4478.0
Price    699900.0
Score       100.0
Name: 13, dtype: float64

In [14]:
N = 100000
ab = pd.DataFrame({'A': np.arange(1, N), 'B': np.arange(1, N)})
ab.head()

   A  B
0  1  1
1  2  2
2  3  3
3  4  4
4  5  5

In [15]:
ab.loc[lambda row: (row.A ** .5) % 1 == 0].head()

     A   B
0    1   1
3    4   4
8    9   9
15  16  16
24  25  25

## Example Apply

In [16]:
N = 100000
ab = pd.DataFrame({'A': np.arange(1, N), 'B': np.arange(1, N)})
ab.head()

   A  B
0  1  1
1  2  2
2  3  3
3  4  4
4  5  5

In [17]:
%timeit ab['C'] = ab['A'] + ab['B']

867 µs ± 65.3 µs per loop (mean ± std. dev. of 7 runs, 1000 loops each)

In [18]:
%timeit ab['C'] = ab.apply(lambda row: row['A'] + row['B'], axis = 1)

2.24 s ± 12 ms per loop (mean ± std. dev. of 7 runs, 1 loop each)

## Method Chaining

In [19]:
top5 = ( df[['Size', 'Price']]
    [df['Size'] > 1000]
    .sort_values(by='Price', ascending=[False])
    .head(5))

In [20]:
top5.head()

    Size   Price
13  4478  699900
19  3031  599000
33  3137  579900
24  3890  573900
38  4215  549000